#ifndef CA51F_CONFIG_H
#define CA51F_CONFIG_H
/***************************************************************************************************************/



#include "ca51f5sfr.h"


/*************************UART功能开关宏定义********************************************************************/
//#define UART0_EN			//如果使用UART0，打开此宏定义

#define PRINT_EN				//使用uart_printf函数打印使能

#ifdef PRINT_EN
	#define UART0_EN
#endif
#define UART0_BAUTRATE		115200

/*********************************************************************************************************************/
#endif										

